import random
# print('\u25cf \u250c \u2500 \u2510 \u2502 \u2514 \u2518')
# ● ┌ ─ ┐ │ └ ┘
#        ┌─────────┐
#        │         │ 
#        │         │ 
#        │         │  
#        └─────────┘
dice_art={
    1:('┌─────────┐',
       '│         │', 
       '│    ●    │', 
       '│         │',  
       '└─────────┘'),
    2:('┌─────────┐',
       '│ ●       │', 
       '│         │', 
       '│       ● │',  
       '└─────────┘'),
    3:('┌─────────┐',
       '│ ●       │', 
       '│    ●    │', 
       '│       ● │',  
       '└─────────┘'),
    4:('┌─────────┐',
       '│ ●     ● │', 
       '│         │', 
       '│ ●     ● │',  
       '└─────────┘'),
    5:('┌─────────┐',
       '│ ●     ● │', 
       '│    ●    │', 
       '│ ●     ● │',  
       '└─────────┘'),
    6:('┌─────────┐',
       '│ ●     ● │', 
       '│ ●     ● │', 
       '│ ●     ● │',  
       '└─────────┘')}

dice=[]
total=0
x=int(input('Enter number of dice? :'))
for i in range(x):
    dice.append(random.randint(1,6))
# for i in range(x):
    # for j in dice_art.get(dice[i]): # dices in different lines
#         print(j)

for line in range(5):
    for i in dice:
        print(dice_art.get(i)[line],end='')
    print()

for i in dice:
    total+=i
print(f'Total: {total}')

     